
let community = {
  "440304001": {
    "name": "南园街道",
      "data": [
      {
        "name": "东园",
        "data": "440304001010"
      },
      {
        "name": "南华",
        "data": "440304001007"
      },
      {
        "name": "南园",
        "data": "440304001004"
      },
      {
        "name": "园西",
        "data": "440304001005"
      },
      {
        "name": "巴登",
        "data": "440304001001"
      },
      {
        "name": "沙埔头",
        "data": "440304001003"
      },
      {
        "name": "滨江",
        "data": "440304001002"
      },
      {
        "name": "滨河",
        "data": "440304001009"
      },
      {
        "name": "玉田",
        "data": "440304001011"
      },
      {
        "name": "赤尾",
        "data": "440304001008"
      },
      {
        "name": "锦龙",
        "data": "440304001006"
      }
    ]
  },
  "440304002": {
    "name": "园岭街道",
      "data": [
      {
        "name": "上林",
        "data": "440304002007"
      },
      {
        "name": "华林",
        "data": "440304002010"
      },
      {
        "name": "南天",
        "data": "440304002008"
      },
      {
        "name": "园东",
        "data": "440304002002"
      },
      {
        "name": "红荔",
        "data": "440304002001"
      },
      {
        "name": "长城",
        "data": "440304002006"
      },
      {
        "name": "鹏盛",
        "data": "440304002009"
      }
    ]
  },
  "440304003": {
    "name": "福田街道",
      "data": [
      {
        "name": "口岸",
        "data": "440304003004"
      },
      {
        "name": "圩镇",
        "data": "440304003003"
      },
      {
        "name": "岗厦",
        "data": "440304003009"
      },
      {
        "name": "水围",
        "data": "440304003007"
      },
      {
        "name": "海滨",
        "data": "440304003010"
      },
      {
        "name": "渔农",
        "data": "440304003008"
      },
      {
        "name": "皇岗",
        "data": "440304003013"
      },
      {
        "name": "福华",
        "data": "440304003001"
      },
      {
        "name": "福南",
        "data": "440304003014"
      },
      {
        "name": "福安",
        "data": "440304003002"
      },
      {
        "name": "福山",
        "data": "440304003005"
      },
      {
        "name": "福民",
        "data": "440304003006"
      },
      {
        "name": "福田",
        "data": "440304003012"
      }
    ]
  },
  "440304004": {
    "name": "沙头街道",
      "data": [
      {
        "name": "上沙",
        "data": "440304004006"
      },
      {
        "name": "下沙",
        "data": "440304004005"
      },
      {
        "name": "天安",
        "data": "440304004010"
      },
      {
        "name": "新华",
        "data": "440304004007"
      },
      {
        "name": "新沙",
        "data": "440304004001"
      },
      {
        "name": "新洲",
        "data": "440304004003"
      },
      {
        "name": "沙咀",
        "data": "440304004004"
      },
      {
        "name": "沙尾",
        "data": "440304004013"
      },
      {
        "name": "翠湾",
        "data": "440304004015"
      },
      {
        "name": "金地",
        "data": "440304004012"
      },
      {
        "name": "金城",
        "data": "440304004009"
      },
      {
        "name": "金碧",
        "data": "440304004016"
      }
    ]
  },
  "440304005": {
    "name": "香蜜湖街道",
      "data": [
      {
        "name": "东海",
        "data": "440304005008"
      },
      {
        "name": "农园",
        "data": "440304005006"
      },
      {
        "name": "竹园",
        "data": "440304005005"
      },
      {
        "name": "竹林",
        "data": "440304005001"
      },
      {
        "name": "香安",
        "data": "440304005002"
      },
      {
        "name": "香岭",
        "data": "440304005004"
      },
      {
        "name": "香梅",
        "data": "440304005003"
      },
      {
        "name": "香蜜",
        "data": "440304005007"
      }
    ]
  },
  "440304006": {
    "name": "梅林街道",
      "data": [
      {
        "name": "下梅",
        "data": "440304006003"
      },
      {
        "name": "孖岭",
        "data": "440304006009"
      },
      {
        "name": "新阁",
        "data": "440304006010"
      },
      {
        "name": "梅丰",
        "data": "440304006004"
      },
      {
        "name": "梅京",
        "data": "440304006005"
      },
      {
        "name": "梅亭",
        "data": "440304006006"
      },
      {
        "name": "梅林一村",
        "data": "440304006011"
      },
      {
        "name": "梅河",
        "data": "440304006012"
      },
      {
        "name": "梅都",
        "data": "440304006007"
      },
      {
        "name": "翰岭",
        "data": "440304006013"
      },
      {
        "name": "龙尾",
        "data": "440304006008"
      },
      {
        "name": "上梅",
        "data": "440304006001"
      },
      {
        "name": "新兴",
        "data": "440304006002"
      }
    ]
  },
  "440304007": {
    "name": "莲花街道",
      "data": [
      {
        "name": "康欣",
        "data": "440304007009"
      },
      {
        "name": "彩田",
        "data": "440304007012"
      },
      {
        "name": "彩虹",
        "data": "440304007002"
      },
      {
        "name": "景华",
        "data": "440304007005"
      },
      {
        "name": "景田",
        "data": "440304007004"
      },
      {
        "name": "梅富",
        "data": "440304007010"
      },
      {
        "name": "梅岭",
        "data": "440304007007"
      },
      {
        "name": "狮岭",
        "data": "440304007008"
      },
      {
        "name": "福中",
        "data": "440304007001"
      },
      {
        "name": "福新",
        "data": "440304007011"
      },
      {
        "name": "紫荆",
        "data": "440304007006"
      },
      {
        "name": "莲花北",
        "data": "440304007003"
      }
    ]
  },
  "440304008": {
    "name": "华富街道",
      "data": [
      {
        "name": "华山",
        "data": "440304008002"
      },
      {
        "name": "新田",
        "data": "440304008007"
      },
      {
        "name": "梅岗",
        "data": "440304008001"
      },
      {
        "name": "田面",
        "data": "440304008006"
      },
      {
        "name": "莲花一村",
        "data": "440304008010"
      },
      {
        "name": "莲花三村",
        "data": "440304008008"
      },
      {
        "name": "莲花二村",
        "data": "440304008009"
      },
      {
        "name": "黄木岗",
        "data": "440304008004"
      }
    ]
  },
  "440304009": {
    "name": "华强北街道",
      "data": [
      {
        "name": "华红",
        "data": "440304009005"
      },
      {
        "name": "华航",
        "data": "440304009003"
      },
      {
        "name": "福强",
        "data": "440304009002"
      },
      {
        "name": "荔村",
        "data": "440304009004"
      },
      {
        "name": "通新岭",
        "data": "440304009001"
      }
    ]
  },
  "440304010": {
    "name": "福保街道",
      "data": [
      {
        "name": "新港",
        "data": "440304010001"
      },
      {
        "name": "明月",
        "data": "440304010004"
      },
      {
        "name": "益田",
        "data": "440304010003"
      },
      {
        "name": "石厦",
        "data": "440304010005"
      },
      {
        "name": "福保",
        "data": "440304010002"
      }
    ]
  }
},
  street = [
    {
      "name": "全部",
      "data": "all"
    },
  {
    "name": "南园街道",
    "data": "440304001"
  },
  {
    "name": "园岭街道",
    "data": "440304002"
  },
  {
    "name": "福田街道",
    "data": "440304003"
  },
  {
    "name": "沙头街道",
    "data": "440304004"
  },
  {
    "name": "香蜜湖街道",
    "data": "440304005"
  },
  {
    "name": "梅林街道",
    "data": "440304006"
  },
  {
    "name": "莲花街道",
    "data": "440304007"
  },
  {
    "name": "华富街道",
    "data": "440304008"
  },
  {
    "name": "华强北街道",
    "data": "440304009"
  },
  {
    "name": "福保街道",
    "data": "440304010"
  }
]

function selectCommunityById (id){
  return community[id]
}
export {street,selectCommunityById}

let unitSecond = {
  "001":{
    name:"城市生命线预警",
    data:[
      {name:"城市供水预警",data:"001001"},
      {name:"城市供电预警",data:"001002"},
      {name:"城市燃气供应预警",data:"001003"}
      ]
  },
  "002":{
    name:"重点企业预警",
    data:[
      {
        name:"企业外迁",data:"002001"},
      {name:"劳资纠纷",data:"002002"}
      ]
  },
  "003":{
    name:"生态环境预警",
    data:[
      {name:"空气质量预警",data:"003001"},
      {name:"水环境预警",data:"003002"},
      {name:"固废预警",data:"003003"},
      {name:"噪声预警",data:"003004"}
      ]
  },
  "004":{
    name:"气象预警",
    data:[
      {name:"高温预警",data:"004001"},
      {name:"台风预警",data:"004002"},
      {name:"雷电预警",data:"004003"},
      {name:"暴雨预警",data:"004004"},
      {name:"大风预警",data:"004005"}
      ]
  },
  "005":{
    name:"地质灾害预警",
    data:[
      {name:"边坡",data:"005001"},
      {name:"道路病害",data:"005002"}
      ]
  },
  "006":{
    name:"三防预警",
    data:[
      {name:"水库预警",data:"006001"},
      {name:"河道预警",data:"006002"},
      {name:"积涝点预警",data:"006003"}
      ]
  },
  "007":{
    name:"消防预警",
    data:[
      {name:"建筑消防风险预警",data:"007001"},
      {name:"烟感预警",data:"007002"}
      ]
  },
  "008":{
    name:"安监预警",
    data:[
      {name:"城区风险预警",data:"008001"}
      ]
  },
  "009":{
    name:"卫计预警",
    data:[
      {name:"特殊病种",data:"009001"}
      ]
  },
  "010":{
    name:"舆情预警",
    data:[
      {name:"舆情",data:"010001"}
      ]
  }
}

 let unit = [{name:"城市生命线预警",data:"001"},
    {name:"重点企业预警",data:"002"},
    {name:"生态环境预警",data:"003"},
    {name:"气象预警",data:"004"},
    {name:"地质灾害预警",data:"005"},
    {name:"三防预警",data:"006"},
    {name:"消防预警",data:"007"},
    {name:"安监预警",data:"008"},
    {name:"卫计预警",data:"009"},
    {name:"舆情预警",data:"010"}]

let unitTemp = {
  "城市生命线预警": "001",
  "重点企业预警": "002",
  "生态环境预警": "003",
  "气象预警": "004",
  "地质灾害预警": "005",
  "三防预警": "006",
  "消防预警": "007",
  "安监预警": "008",
  "卫计预警": "009",
  "舆情预警": "010"
}

export {unitTemp,unit,unitSecond}

